#include <stdio.h>
#include <stdlib.h>

void main()
{

//Створити цілочисельну змінну і вказівник такого ж базового типу. Задати значення змінної із консолі. Вивести його на консоль.
int var;
int* adr;
printf("put int var>>");
scanf("%i",&var);
printf("int var=%i\n",var);
//Вказати вказівник на змінну. Ввести нове цілочисельне значення і через вказівник передати його змінній, на яку він вказує.

adr=&var;
printf("put int var>>\n");
scanf("%i",adr);
//Вивести значення змінної.
printf("int var=%i\n",var);
//Створити цілочисельну змінну і два вказівника, яку вказати на дану змінну. Задати значення змінної через перший вказівник.
int var1;
int* p1=&var1;
int* p2;
p2=&var1;
printf("put int var1>>");
scanf("%i",p1);
//Вивести значення змінної через другий вказівник.
printf("\nint var1=%i",*p2);
//Створити і заповнити масив цілих чисел. Створити вказівник і вказати його на перший елемент масиву. Вивести значення елементів масиву на екран не використовуючи прямий доступ до елементів (тобто []), а за допомогою перевказування вказівників на наступні елементи масиву і виводу значення комірки на яку вказує вказівник.

int mas[10]={0,1,2,3,4,5,6,7,8,9};
int *p3;
p3=mas;
int i;
printf("\n");
while(p3!=mas+10)
    {printf("%i, ",*p3);
    p3++;}
//Створити і заповнити масив цілих чисел. Створити вказівник і вказати його на останній елемент масиву. Вивести значення елементів масиву на екран не використовуючи прямий доступ до елементів, а за допомогою перевказування вказівників на попередніелементи масиву і виводу значення комірки на яку вказує вказівник. (Масив виведеться навпаки)
int mas4[10]={0,1,2,3,4,5,6,7,8,9};
int *p4;
p4=mas4+9;

printf("\n");
do
    {printf("%i, ",*p4);
    p4--;}
while(p4!=mas4-1);
//Заданий масив цілих чисел і вказівник на початок цього масиву. Вивести всі від'ємні елементи масиву використовуючи тільки вказівник.
int mas5[10]={0,-1,2,3,4,-5,6,7,-8,9};
int *p5;
p5=mas5;
printf("\n");
while(p5!=mas5+10)
    {
        if(*p5<0)
        printf("%i, ",*p5);
    p5++;}
//Заданий масив дробових чисел (непарної довжини)  і два вказівники. Перший вказує на перший елемент масиву, другий на останній елемент масиву. Змінювати перший вказівник на наступні елементи, другий на попередні поки вказівники не будуть вказувати на один і той же елемент. Щоразу виводити у консоль результат ділення значення, на яке вказує перший вказівник на значення на який вказує другий вказівник.
double mas6[9]={0.0,-1.25,2.56,3.67,4.89,-5.34,6.12,7.546,-8.876};
int *p61,*p62;
p61=mas6;
p62=mas6+9;
printf("\n");
double d;
while(p61!=p62)
    {
d=(double)*p61/ (*p62);
        printf("%f, ",d);
    p61++;
    p62--;}

//Заданий масив символів і вказівник на його перший елемент. Вивести символи масиву на екран за допомогою зміни вказівника.
char charz[]={'d','e','f','a','u','l','t'};
char *pes=charz;
printf("\n");

while(pes!=charz+7)
{
    printf("%c",*pes);
    pes++;
}
//У масиві символів знайти перший пустий елемент (через вказівник на початок масиву) і замінити значення елементу на символ '\0'. Вивести масив як строку у консоль.
char charz1[]={'d','e',' ','a','u','l','t'};
char *pes1=charz1;
printf("\n");

while(pes1!=charz1+7)
{
    if(*pes1==' ')
    {*pes1='\0';
    puts(charz1);

    break;
    }
    pes1++;
}
























































}
