#include <stdio.h>
#include <stdlib.h>

int main()
{
//Створити масив строк. Заповнити масив строками, які введе користувач. Вивести масив строк у консоль

    puts("Put strings>>");
    int i;

        char mas[3][50];

        for(i=0;i<3;i++)
        {
        gets(mas[i]);
        }
        printf("\n\n");
        for(i=0;i<3;i++)
        {
        puts(mas[i]);
        }
  // Заданий масив строк і окремо одна строка. Перевірити чи окрема строка міститься у масиві строк хоча б раз.


    return 0;
}
